[
  {
    "id": 2,
    "aptId": null,
    "landlordId": 2,
    "overallRating": null,
    "detailedRatings.location": null,
    "detailedRatings.safety": null,
    "detailedRatings.value": null,
    "detailedRatings.maintenance": null,
    "detailedRatings.communication": null,
    "detailedRatings.condition": null,
    "reviewText": "I recently moved into this specific apartment just at the start of June. Thus far, I have had nothing significantly noteworthy in terms of complaints regarding management or the building. The apartment was predominantly clean when I moved in, with only minor issues. One apartment issue - electrical related - I have yet to hear back on besides \"We'll contact the electrician.\" I've taken to not using the outlets which pose reliability issues. \n\nI am able to provide experiences about previous landlords over the years in Ithaca. (Most of which were not stellar)",
    "date": "June 17, 2020"
  },
  {
    "id": 3,
    "aptId": 237.0,
    "landlordId": 14,
    "overallRating": 5.0,
    "detailedRatings.location": 5.0,
    "detailedRatings.safety": 4.0,
    "detailedRatings.value": 4.0,
    "detailedRatings.maintenance": 4.0,
    "detailedRatings.communication": 4.0,
    "detailedRatings.condition": 4.0,
    "reviewText": "I've really enjoyed this apartment. I lived in an apartment of 6 and it was still quite spacious for us. My only gripes would be the kitchen is a little too small for 6 people and the drying/washer machines are kind of weak.",
    "date": "April 10, 2021"
  },
  {
    "id": 4,
    "aptId": 238.0,
    "landlordId": 15,
    "overallRating": 5.0,
    "detailedRatings.location": 5.0,
    "detailedRatings.safety": 4.0,
    "detailedRatings.value": 4.0,
    "detailedRatings.maintenance": 5.0,
    "detailedRatings.communication": 5.0,
    "detailedRatings.condition": 4.0,
    "reviewText": "I've enjoyed my time living at 312 College Ave. The rent is high but you do get what you pay for. The location is good and I've had no complaints about the staff, maintenance, security, or anything like that. Utilities except for electricity are also covered. My kitchen was recently upgraded for free which is a plus. My only problem with this apartment is its price.",
    "date": "March 31, 2021"
  },
  {
    "id": 5,
    "aptId": 129.0,
    "landlordId": 16,
    "overallRating": 4.0,
    "detailedRatings.location": 1.0,
    "detailedRatings.safety": 3.0,
    "detailedRatings.value": 4.0,
    "detailedRatings.maintenance": 4.0,
    "detailedRatings.communication": 4.0,
    "detailedRatings.condition": 4.0,
    "reviewText": "I enjoy the cheap, affordable living space as well as the cheap parking. However, it is too far from campus and Collegetown, and there is an extra slope to walk up in order to go anywhere.",
    "date": "March 31, 2021"
  },
  {
    "id": 6,
    "aptId": 107.0,
    "landlordId": 12,
    "overallRating": 4.0,
    "detailedRatings.location": 4.0,
    "detailedRatings.safety": 4.0,
    "detailedRatings.value": 4.0,
    "detailedRatings.maintenance": 4.0,
    "detailedRatings.communication": 4.0,
    "detailedRatings.condition": 4.0,
    "reviewText": "Pretty spacious, reasonable rent price, and an overall good place to live! It's pretty close to Collegetown so location is also convenient. Apartment was pretty clean when we moved in!",
    "date": "March 30, 2021"
  },
  {
    "id": 7,
    "aptId": 107.0,
    "landlordId": 12,
    "overallRating": 3.0,
    "detailedRatings.location": 4.0,
    "detailedRatings.safety": 4.0,
    "detailedRatings.value": 5.0,
    "detailedRatings.maintenance": 2.0,
    "detailedRatings.communication": 2.0,
    "detailedRatings.condition": 3.0,
    "reviewText": "Overall my experience has been pretty good outside of maintenance issues. The location is very close to campus and the apartment is quite spacious for something at this price point. Furthermore, since the apartment is mirrored, we have two of everything, like kitchens, appliances, bathrooms, etc. which is quite convenient. If you're not worried about having the nicest apartment or dealing with maintenance, it is a fine apartment!",
    "date": "March 30, 2021"
  },
  {
    "id": 8,
    "aptId": 64.0,
    "landlordId": 8,
    "overallRating": 4.0,
    "detailedRatings.location": 4.0,
    "detailedRatings.safety": 4.0,
    "detailedRatings.value": 5.0,
    "detailedRatings.maintenance": 5.0,
    "detailedRatings.communication": 3.0,
    "detailedRatings.condition": 5.0,
    "reviewText": "Great location to everything and right above Greenstar. Everything is good and the rooms are really pretty. Floors are very sturdy so you can exercise in it. Walls are kind of thin and you can hear roommates. Bathroom and kitchen facilities are average. Rooms are really big but the shared living space is smaller than expected. The major downside I have of the apartment is that I live on the college avenue side on the 2nd floor so I can hear everything outside. It is really annoying and wakes me up in the morning and keeps up at night. If it was a normal semester it would be 100x more annoying with the parties in Collegetown. It is a good apartment, but I do not think it is worth the price. Also, I would not live in the same room again because the noise from the street was too annoying. I think people in other locations of the apartment wouldn't have that complaint though. ",
    "date": "March 31, 2021"
  },
  {
    "id": 9,
    "aptId": 14.0,
    "landlordId": 4,
    "overallRating": 4.0,
    "detailedRatings.location": 4.0,
    "detailedRatings.safety": 4.0,
    "detailedRatings.value": 3.0,
    "detailedRatings.maintenance": 5.0,
    "detailedRatings.communication": 3.0,
    "detailedRatings.condition": 5.0,
    "reviewText": "I think overall it's pretty good but during COVID-19, they are not being very understanding. For example, many international students weren't able to travel back to Ithaca and they hoped to defer or terminate the lease. However, the CTT staff won't allow termination of lease at all and we must sublet the house with a lower rate by ourselves. At the same time, they allowed certain tenants to defer the lease, which is very unfair and confusing. ",
    "date": "March 31, 2021"
  },
  {
    "id": 10,
    "aptId": 235.0,
    "landlordId": 32,
    "overallRating": 2.0,
    "detailedRatings.location": 4.0,
    "detailedRatings.safety": 3.0,
    "detailedRatings.value": 2.0,
    "detailedRatings.maintenance": 2.0,
    "detailedRatings.communication": 1.0,
    "detailedRatings.condition": 1.0,
    "reviewText": "The landlord is very hard to deal with. When I first moved in she said she cleaned the apartment and shampooed the carpets before our move in date, but it was very clear that she did neither; the carpets had large stains all over them and the apartment didn't look like it had been cleaned anytime recently. In the begining of the fall semester, she scheduled a tour without letting us know and people just randomly and unexpectedly walked into the apartment. Besides that, the apartment is not well maintained. It needs new furniture and the carpets need to be cleaned. I would not recommend this place to anyone. ",
    "date": "April 3, 2021"
  },
  {
    "id": 11,
    "aptId": 235.0,
    "landlordId": 32,
    "overallRating": 1.0,
    "detailedRatings.location": 4.0,
    "detailedRatings.safety": 3.0,
    "detailedRatings.value": 2.0,
    "detailedRatings.maintenance": 1.0,
    "detailedRatings.communication": 2.0,
    "detailedRatings.condition": 1.0,
    "reviewText": "Overall, the apartment itself is spacious and in a good location a 15 min walk to campus. It had the potential to be a good apt because of its space and location but all the other issues made the experience really bad. The landlord was often rude and not understanding; she made us pay 7 months of rent (2 months security deposit and 5 months shortly after) before our lease started and before we even got the keys. At the time, the pandemic had just started and everything was up in the air, and we didn't know what our plans were, and she was threatening to press charges a whole week before the 5 months of rent was even due.",
    "date": "April 10, 2021"
  },
  {
    "id": 12,
    "aptId": 123.0,
    "landlordId": 13,
    "overallRating": 5.0,
    "detailedRatings.location": 5.0,
    "detailedRatings.safety": 5.0,
    "detailedRatings.value": 5.0,
    "detailedRatings.maintenance": 5.0,
    "detailedRatings.communication": 5.0,
    "detailedRatings.condition": 5.0,
    "reviewText": "Renting at this location has been my best rental experience in Ithaca! The biggest pro is that it's an excellent value - the property is so well renovated and taken care of that living in the unit is seamless, and the proximity to several locations cannot be beaten. ",
    "date": "March 30, 2021"
  },
  {
    "id": 13,
    "aptId": 42.0,
    "landlordId": 6,
    "overallRating": 3.0,
    "detailedRatings.location": 4.0,
    "detailedRatings.safety": 5.0,
    "detailedRatings.value": 4.0,
    "detailedRatings.maintenance": 4.0,
    "detailedRatings.communication": 4.0,
    "detailedRatings.condition": 4.0,
    "reviewText": "The landlord is pretty nice, and the location and living conditions are decent. The views outside the window are not great though, and the price is a bit steep (probably because of the location). Rent needs to be paid via check, which is inconvenient if you're not in Ithaca. Trash and laundry are not included in the rent, and if you need parking you need to buy a spot through a third party.",
    "date": "March 29, 2021"
  },
  {
    "id": 14,
    "aptId": null,
    "landlordId": 10,
    "overallRating": 4.0,
    "detailedRatings.location": 5.0,
    "detailedRatings.safety": 4.0,
    "detailedRatings.value": 2.0,
    "detailedRatings.maintenance": 3.0,
    "detailedRatings.communication": 3.0,
    "detailedRatings.condition": 2.0,
    "reviewText": "The apartment is on the expensive side for its condition and maintenance. The positive thing is its location, which is really close to campus. The room is small and the condition is below average. No soundproof which can be annoy at times. ",
    "date": "March 31, 2021"
  },
  {
    "id": 15,
    "aptId": 91.0,
    "landlordId": 10,
    "overallRating": 3.0,
    "detailedRatings.location": 4.0,
    "detailedRatings.safety": 5.0,
    "detailedRatings.value": 3.0,
    "detailedRatings.maintenance": 5.0,
    "detailedRatings.communication": 4.0,
    "detailedRatings.condition": 3.0,
    "reviewText": "Pretty good - kind of rough for corona since it is a little small at times and Ithaca collegetown kids do pull up outside late at night because it's on a more major road.",
    "date": "April 4, 2021"
  },
  {
    "id": 16,
    "aptId": 84.0,
    "landlordId": 10,
    "overallRating": 5.0,
    "detailedRatings.location": 5.0,
    "detailedRatings.safety": 4.0,
    "detailedRatings.value": 4.0,
    "detailedRatings.maintenance": 4.0,
    "detailedRatings.communication": 5.0,
    "detailedRatings.condition": 5.0,
    "reviewText": "Despite the rather expensive pricing, the location (right in the heart of Collegetown) covers most of the small issues. Plus, although this might be a unique advantage of high floor apartments, the street noise is nearly inaudible. ",
    "date": "April 8, 2021"
  },
  {
    "id": 17,
    "aptId": 86.0,
    "landlordId": 10,
    "overallRating": 4.0,
    "detailedRatings.location": 4.0,
    "detailedRatings.safety": 4.0,
    "detailedRatings.value": 4.0,
    "detailedRatings.maintenance": 4.0,
    "detailedRatings.communication": 4.0,
    "detailedRatings.condition": 4.0,
    "reviewText": "Pretty good, staff are friendly and responsive. The rent is pretty reasonable compare to other apartments in college town. Super convenient, everything is right downstairs. Need to pick up packages from ithaca renting office.",
    "date": "April 10, 2021"
  },
  {
    "id": 18,
    "aptId": 89.0,
    "landlordId": 10,
    "overallRating": 4.0,
    "detailedRatings.location": 5.0,
    "detailedRatings.safety": 4.0,
    "detailedRatings.value": 5.0,
    "detailedRatings.maintenance": 4.0,
    "detailedRatings.communication": 4.0,
    "detailedRatings.condition": 3.0,
    "reviewText": "The value is the best part -- only around $765 for a single in the heart of collegetown. It feels a bit jank since you share two bathrooms and a kitchen with the rest of the floor, and it looks run-down on both the inside and outside, but for the price and location I'm not complaining.\n\nMaintenance is also good. They have someone who is always on call and can come within an hour or so. There was one time where I was locked out of my apartment because the door jammed and I called but they didn't come until next morning so I slept on the couch in the common area, but besides that they've been great.",
    "date": "April 10, 2021"
  },
  {
    "id": 19,
    "aptId": 86.0,
    "landlordId": 10,
    "overallRating": 4.0,
    "detailedRatings.location": 5.0,
    "detailedRatings.safety": 5.0,
    "detailedRatings.value": 4.0,
    "detailedRatings.maintenance": 4.0,
    "detailedRatings.communication": 4.0,
    "detailedRatings.condition": 4.0,
    "reviewText": "The apartment is decently prices and the location is great. The only downside is that we need to physically go to the office to pick up our packages. Maintenance sometimes takes a long time.",
    "date": "April 10, 2021"
  },
  {
    "id": 20,
    "aptId": 84.0,
    "landlordId": 10,
    "overallRating": 4.0,
    "detailedRatings.location": 4.0,
    "detailedRatings.safety": 4.0,
    "detailedRatings.value": 4.0,
    "detailedRatings.maintenance": 4.0,
    "detailedRatings.communication": 4.0,
    "detailedRatings.condition": 4.0,
    "reviewText": "The apartment is good and I enjoy living here because of its closeness to the campus, good maintenance and closeness to restaurants/stores. The landlord are friendly and send out timely emails about important notices, package arrivals and any such details. While everything is comfortable, sometimes it feels a bit small compared to the price I pay. Overall, I enjoy living here and it's a great place for roommates.",
    "date": "April 10, 2021"
  },
  {
    "id": 21,
    "aptId": 94.0,
    "landlordId": 10,
    "overallRating": 3.0,
    "detailedRatings.location": 4.0,
    "detailedRatings.safety": 4.0,
    "detailedRatings.value": 2.0,
    "detailedRatings.maintenance": 3.0,
    "detailedRatings.communication": 4.0,
    "detailedRatings.condition": 2.0,
    "reviewText": "This apartment is generally very old. There are some wear-downs in the apartment, but the maintenance service is relatively quick and communicates well. There is not much ventilation in the apartment so it gets quite hot in the summer. The rent is ok, not too high not too low. There is a deli right downstairs (very convenient for snacks :) )",
    "date": "April 10, 2021"
  },
  {
    "id": 22,
    "aptId": 211.0,
    "landlordId": 10,
    "overallRating": 5.0,
    "detailedRatings.location": 5.0,
    "detailedRatings.safety": 3.0,
    "detailedRatings.value": 4.0,
    "detailedRatings.maintenance": 5.0,
    "detailedRatings.communication": 3.0,
    "detailedRatings.condition": 4.0,
    "reviewText": "I feel like I live pretty close to everyone I know. It's not that far from campus either. I really like having my own kitchen and bathroom. It's so close to the engineering quad and Starbucks, so it's been really convenient",
    "date": "March 31, 2021"
  },
  {
    "id": 23,
    "aptId": 131.0,
    "landlordId": 17,
    "overallRating": 4.0,
    "detailedRatings.location": 3.0,
    "detailedRatings.safety": 5.0,
    "detailedRatings.value": 4.0,
    "detailedRatings.maintenance": 5.0,
    "detailedRatings.communication": 5.0,
    "detailedRatings.condition": 4.0,
    "reviewText": "The quality price ratio is very good. It's a quiet neighborhood and the layout is not bad. I can get to the main campus within 20 min walk and there's also a bus stop around. The room is not big but it's good enough for me. The landlord provides all necessary furnitures including a microwave, a fridge, and a tv. We don't need to pay anything extra except for the electricity bill. They are also super responsive to our maintenance requests. The layout is a bit weird. The bedrooms are right next to the living room so sometimes it can be a bit distracting when your roommates are hanging out while you need to do work, but this can happen in other places as well and I can just solve it with earbuds. Overall, not the best apartment out there but there's nothing bad about it. Plus the price is super good.",
    "date": "April 10, 2021"
  },
  {
    "id": 24,
    "aptId": 140.0,
    "landlordId": 18,
    "overallRating": 5.0,
    "detailedRatings.location": 5.0,
    "detailedRatings.safety": 5.0,
    "detailedRatings.value": 5.0,
    "detailedRatings.maintenance": 4.0,
    "detailedRatings.communication": 5.0,
    "detailedRatings.condition": 5.0,
    "reviewText": "I've had a great time overall and would recommend living here, it's just expensive but most of the time it's quiet, but the noise from neighbors still gets through. It's way more loud in the center of collegetown anyway. I would say it's one of the cleanest and well maintained buildings I saw during my tours and I enjoy living there right now.",
    "date": "April 10, 2021"
  },
  {
    "id": 25,
    "aptId": null,
    "landlordId": 18,
    "overallRating": 4.0,
    "detailedRatings.location": 5.0,
    "detailedRatings.safety": 3.0,
    "detailedRatings.value": 4.0,
    "detailedRatings.maintenance": 4.0,
    "detailedRatings.communication": 4.0,
    "detailedRatings.condition": 4.0,
    "reviewText": "I really like the apartment I live in, the building has about 50 people in it and I know basically everyone. It's also all girls (mainly from my sorority) which is honestly really comforting and it's so fun to know everyone. The staff are pretty helpful when we call for maintenance repairs, but usually it takes a few phone calls and reminders to get them to actually come. It's also pretty expensive. But overall great experience",
    "date": "March 30, 2021"
  },
  {
    "id": 26,
    "aptId": null,
    "landlordId": 18,
    "overallRating": 3.0,
    "detailedRatings.location": 4.0,
    "detailedRatings.safety": 5.0,
    "detailedRatings.value": 4.0,
    "detailedRatings.maintenance": 3.0,
    "detailedRatings.communication": 3.0,
    "detailedRatings.condition": 4.0,
    "reviewText": "Great experience in a quiet location. The value of the apartment is really good for the price, specifically for the size. Cons are an older building, and a landlord who isn't very responsive.",
    "date": "April 10, 2021"
  },
  {
    "id": 27,
    "aptId": null,
    "landlordId": 19,
    "overallRating": 5.0,
    "detailedRatings.location": 4.0,
    "detailedRatings.safety": 5.0,
    "detailedRatings.value": 5.0,
    "detailedRatings.maintenance": 4.0,
    "detailedRatings.communication": 3.0,
    "detailedRatings.condition": 5.0,
    "reviewText": "It's a pretty spacious and comfortable apartment, and there are all the necessary amenities provided here. The apartment staff is responsive when we file complaints/need some fixing. Rooms are not too big but the size has never been an issue.",
    "date": "April 9, 2021"
  },
  {
    "id": 28,
    "aptId": 165.0,
    "landlordId": 20,
    "overallRating": 5.0,
    "detailedRatings.location": 4.0,
    "detailedRatings.safety": 5.0,
    "detailedRatings.value": 5.0,
    "detailedRatings.maintenance": 5.0,
    "detailedRatings.communication": 5.0,
    "detailedRatings.condition": 5.0,
    "reviewText": "I've loved living here and I've had an amazing experience with the landlords as well. Despite being far, it is a great price and the bus stop makes up for it. I'm planning to stay for the next 2 years :))",
    "date": "April 10, 2021"
  },
  {
    "id": 29,
    "aptId": 170.0,
    "landlordId": 20,
    "overallRating": 5.0,
    "detailedRatings.location": 4.0,
    "detailedRatings.safety": 5.0,
    "detailedRatings.value": 4.0,
    "detailedRatings.maintenance": 5.0,
    "detailedRatings.communication": 5.0,
    "detailedRatings.condition": 4.0,
    "reviewText": "Easy access to laundry and trash. Utilities included, which is a plus. Maintenance is really easy to get done and payments can be made online. Overall great landlord / apartment. Also pet friendly!",
    "date": "April 10, 2021"
  },
  {
    "id": 30,
    "aptId": 14.0,
    "landlordId": 4,
    "overallRating": 4.0,
    "detailedRatings.location": 3.0,
    "detailedRatings.safety": 4.0,
    "detailedRatings.value": 4.0,
    "detailedRatings.maintenance": 5.0,
    "detailedRatings.communication": 4.0,
    "detailedRatings.condition": 5.0,
    "reviewText": "CTT is the perfect place to live in terms of facilities and price, if not considering accessibility. However, there is a shuttle which runs every 20 min in the morning (used to be 10 min pre-covid) and once every hour in the afternoon until 4:15pm. There's also a dryer and a washing machine in your room.",
    "date": "March 30, 2021"
  },
  {
    "id": 31,
    "aptId": 14.0,
    "landlordId": 4,
    "overallRating": 4.0,
    "detailedRatings.location": 3.0,
    "detailedRatings.safety": 5.0,
    "detailedRatings.value": 2.0,
    "detailedRatings.maintenance": 4.0,
    "detailedRatings.communication": 4.0,
    "detailedRatings.condition": 4.0,
    "reviewText": "The landlord sometimes seems to be predatory, even when it comes to your lease. They openly say that they will rent your apartment out from under you without notification. I assume as a play to attempt to get tenants to renew their leases. I wouldn't bite at any of these tactics.\n\nBeyond this, I haven't had any problems with safety or cleanliness. They have covered parking under the building, which is my main reason for choosing the apartment.",
    "date": "April 10, 2021"
  },
  {
    "id": 32,
    "aptId": 175.0,
    "landlordId": 21,
    "overallRating": 5.0,
    "detailedRatings.location": 4.0,
    "detailedRatings.safety": 3.0,
    "detailedRatings.value": 4.0,
    "detailedRatings.maintenance": 4.0,
    "detailedRatings.communication": 5.0,
    "detailedRatings.condition": 4.0,
    "reviewText": "I really enjoyed the fact that it came with plants, couch, and the whole furniture setup. I think the hill might be the worst part in terms of getting to the house but the house itself is nice. Really big closets, washer, dryer, dishwasher etc. ",
    "date": "March 31, 2021"
  },
  {
    "id": 33,
    "aptId": 149.0,
    "landlordId": 22,
    "overallRating": 4.0,
    "detailedRatings.location": 4.0,
    "detailedRatings.safety": 4.0,
    "detailedRatings.value": 4.0,
    "detailedRatings.maintenance": 4.0,
    "detailedRatings.communication": 4.0,
    "detailedRatings.condition": 4.0,
    "reviewText": "I like staying at this apartment and have made myself at home here. I don't regret choosing this apartment and would choose to stay here again if I were a freshman again. The landlord and management are quite nice and did not do anything unethical. The location of this apartment is quite nice and we're close to a bus route. The only downside to this apartment is that it's dated. However, this apartment is comfortable and I like it here.",
    "date": "March 31, 2021"
  },
  {
    "id": 34,
    "aptId": 201.0,
    "landlordId": 23,
    "overallRating": 4.0,
    "detailedRatings.location": 4.0,
    "detailedRatings.safety": 3.0,
    "detailedRatings.value": 3.0,
    "detailedRatings.maintenance": 5.0,
    "detailedRatings.communication": 4.0,
    "detailedRatings.condition": 4.0,
    "reviewText": "This apartment is pretty satisfactory. The utilities seem to be pretty high (in the winter it is above $100). The walls and floors are super thin, however, and I can hear basically everything happening in the apartment above and next to ours... Other than that, it's a nice place to call home.",
    "date": "March 31, 2021"
  },
  {
    "id": 35,
    "aptId": 211.0,
    "landlordId": 24,
    "overallRating": 4.0,
    "detailedRatings.location": 5.0,
    "detailedRatings.safety": 4.0,
    "detailedRatings.value": 4.0,
    "detailedRatings.maintenance": 3.0,
    "detailedRatings.communication": 4.0,
    "detailedRatings.condition": 3.0,
    "reviewText": "Overall, it's a very good location. The apartment is average quality, nothing special but also nothing really bad either. I'm moving to another apartment next semester because this 3 bedroom apartment is too small for 5 people, and all of us wanted our own rooms. It's pretty good for the rent we pay, but obviously it comes at a cost. ",
    "date": "March 30, 2021"
  },
  {
    "id": 36,
    "aptId": 215.0,
    "landlordId": 24,
    "overallRating": 3.0,
    "detailedRatings.location": 3.0,
    "detailedRatings.safety": 2.0,
    "detailedRatings.value": 4.0,
    "detailedRatings.maintenance": 3.0,
    "detailedRatings.communication": 3.0,
    "detailedRatings.condition": 3.0,
    "reviewText": "The location isn't ideal and well there are definitely many more places that are in better condition/have better facilities, but the apartment is big and I get to live with many other friends and we have a fairly big living room that we play games in on a daily basis so I dont regret my choice.",
    "date": "April 10, 2021"
  },
  {
    "id": 37,
    "aptId": 211.0,
    "landlordId": 24,
    "overallRating": 4.0,
    "detailedRatings.location": 5.0,
    "detailedRatings.safety": 5.0,
    "detailedRatings.value": 3.0,
    "detailedRatings.maintenance": 4.0,
    "detailedRatings.communication": 2.0,
    "detailedRatings.condition": 4.0,
    "reviewText": "Nice living experience with my best friends. We had a lot of great memories there.\nBut the move-out experience was terrible: because of COVID, my roommates and I all move out in March (2 months before the lease ended). We tried to negotiate a deduction of rent but the leasing company did nothing to help. Also, more than half of our deposit was deducted because of very expensive cleaning fees :(((",
    "date": "April 6, 2021"
  },
  {
    "id": 38,
    "aptId": 211.0,
    "landlordId": 24,
    "overallRating": 4.0,
    "detailedRatings.location": 5.0,
    "detailedRatings.safety": 5.0,
    "detailedRatings.value": 4.0,
    "detailedRatings.maintenance": 4.0,
    "detailedRatings.communication": 4.0,
    "detailedRatings.condition": 4.0,
    "reviewText": "The location is wonderful, the heater is excellent, and all the essential services are provided (laundry, trash, bug extermination, etc.) The only thing is our wifi was a bit spotty sometimes because of the location of our apartment, but it was a minor inconvenience.",
    "date": "April 10, 2021"
  },
  {
    "id": 39,
    "aptId": 64.0,
    "landlordId": 8,
    "overallRating": 5.0,
    "detailedRatings.location": 5.0,
    "detailedRatings.safety": 5.0,
    "detailedRatings.value": 4.0,
    "detailedRatings.maintenance": 5.0,
    "detailedRatings.communication": 5.0,
    "detailedRatings.condition": 5.0,
    "reviewText": "The experience is very good. The apartment looks very nice, with big rooms and big beds. The biggest issue is price, which sucks in more than 2/3 of my internship income :(((",
    "date": "April 5, 2021"
  },
  {
    "id": 40,
    "aptId": 72.0,
    "landlordId": 8,
    "overallRating": 3.0,
    "detailedRatings.location": 4.0,
    "detailedRatings.safety": 3.0,
    "detailedRatings.value": 3.0,
    "detailedRatings.maintenance": 2.0,
    "detailedRatings.communication": 2.0,
    "detailedRatings.condition": 2.0,
    "reviewText": "The people who run Urban Ithaca aren't the best. But, Brad the maintenance man is a goat. The housing is definitely overpriced. And the inside is old and outdated. But, the space and location is nice. ",
    "date": "April 10, 2021"
  },
  {
    "id": 41,
    "aptId": 236.0,
    "landlordId": 8,
    "overallRating": 4.0,
    "detailedRatings.location": 5.0,
    "detailedRatings.safety": 4.0,
    "detailedRatings.value": 5.0,
    "detailedRatings.maintenance": 3.0,
    "detailedRatings.communication": 1.0,
    "detailedRatings.condition": 4.0,
    "reviewText": "Location is extremely hard to beat! 2 minute walk away from CTB and 3 minutes away from campus. Although the real estate company can do a better job of communicating with us about lease agreements and fines, I would say the house itself is really great for what it is.",
    "date": "April 10, 2021"
  },
  {
    "id": 42,
    "aptId": 231.0,
    "landlordId": 25,
    "overallRating": 3.0,
    "detailedRatings.location": 3.0,
    "detailedRatings.safety": 4.0,
    "detailedRatings.value": 3.0,
    "detailedRatings.maintenance": 3.0,
    "detailedRatings.communication": 4.0,
    "detailedRatings.condition": 2.0,
    "reviewText": "I would sum up my experience as: serviceable. Do I want to live her long-term? Definitely not, but for a couple semesters, it'll do. The landlord is not the worst I've had, though she could be better and the rent price is fair.",
    "date": "April 6, 2021"
  },
  {
    "id": 43,
    "aptId": null,
    "landlordId": 25,
    "overallRating": 3.0,
    "detailedRatings.location": 4.0,
    "detailedRatings.safety": 4.0,
    "detailedRatings.value": 3.0,
    "detailedRatings.maintenance": 3.0,
    "detailedRatings.communication": 5.0,
    "detailedRatings.condition": 2.0,
    "reviewText": "Overall I have had somewhat positive experiences here. The location is not ideal but the bus stop makes it very workable. The rooms are generally pretty large and the provided furniture is generally pretty usable (although the bed quality is not great). The biggest issues really come from the fact that many things are quite old. While maintenance is quick, it is still a hassle, and things like the splinter-prone floor and general fragile nature of many objects is unavoidable. ",
    "date": "April 10, 2021"
  },
  {
    "id": 44,
    "aptId": null,
    "landlordId": 3,
    "overallRating": null,
    "detailedRatings.location": null,
    "detailedRatings.safety": null,
    "detailedRatings.value": null,
    "detailedRatings.maintenance": null,
    "detailedRatings.communication": null,
    "detailedRatings.condition": null,
    "reviewText": "I moved into this apartment in April when Ithaca College apartments closed. Tom likes to berate us for things like going on the roof or having plants outside, but refused to help when we had a clogged sink or other issues. The house is pretty worn down, and even though rent is cheap, I feel like all the upkeep is on us. ",
    "date": "June 4, 2020"
  },
  {
    "id": 45,
    "aptId": null,
    "landlordId": 3,
    "overallRating": null,
    "detailedRatings.location": null,
    "detailedRatings.safety": null,
    "detailedRatings.value": null,
    "detailedRatings.maintenance": null,
    "detailedRatings.communication": null,
    "detailedRatings.condition": null,
    "reviewText": "They renovated the bathroom while we lived here and we didn’t have access to a bathroom for two weeks.",
    "date": "May 10, 2020"
  },
  {
    "id": 46,
    "aptId": null,
    "landlordId": 4,
    "overallRating": null,
    "detailedRatings.location": null,
    "detailedRatings.safety": null,
    "detailedRatings.value": null,
    "detailedRatings.maintenance": null,
    "detailedRatings.communication": null,
    "detailedRatings.condition": null,
    "reviewText": "They \"fixed\" our laundry machine twice now and we still pay $2.75 for wet clothes. With Covid: not very responsive, have not offered any rent reductions or delays, have not offered any utility help or otherwise.",
    "date": "May 10, 2020"
  },
  {
    "id": 47,
    "aptId": null,
    "landlordId": 4,
    "overallRating": null,
    "detailedRatings.location": null,
    "detailedRatings.safety": null,
    "detailedRatings.value": null,
    "detailedRatings.maintenance": null,
    "detailedRatings.communication": null,
    "detailedRatings.condition": null,
    "reviewText": "Management staff is very curt and not very helpful. When I asked for a parking permit, I was charged the full amount even though I only had the parking permit for 9 months instead of the full year. They are not being flexible about rent for COVID-19. No rent reduction; don't seem willing to budge on rent for students.",
    "date": "May 10, 2020"
  },
  {
    "id": 48,
    "aptId": null,
    "landlordId": 5,
    "overallRating": null,
    "detailedRatings.location": null,
    "detailedRatings.safety": null,
    "detailedRatings.value": null,
    "detailedRatings.maintenance": null,
    "detailedRatings.communication": null,
    "detailedRatings.condition": null,
    "reviewText": "They ignored my requests, the house was at risk of collapsing, my room was dirty and my rent was crazy high. I’m just lucky I only had to sign a lease of a few months.",
    "date": "May 20, 2020"
  },
  {
    "id": 49,
    "aptId": null,
    "landlordId": 5,
    "overallRating": null,
    "detailedRatings.location": null,
    "detailedRatings.safety": null,
    "detailedRatings.value": null,
    "detailedRatings.maintenance": null,
    "detailedRatings.communication": null,
    "detailedRatings.condition": null,
    "reviewText": "When I first moved in, there were many issues within the apartment that were difficult to live with and actually costed me $$ (ie there was a crack in my front door and the heat I pay for was leaving the house rapidly, and a few other issues that have been recorded with email). I had to continuously email them for the next two months, even had to remind them over and over, until the maintenance was finally done. And still there are issues with the apartment that now with all this chaos happening, I feel nervous about asking them to fix since I haven't paid rent.  ",
    "date": "May 10, 2020"
  },
  {
    "id": 50,
    "aptId": 42.0,
    "landlordId": 6,
    "overallRating": null,
    "detailedRatings.location": null,
    "detailedRatings.safety": null,
    "detailedRatings.value": null,
    "detailedRatings.maintenance": null,
    "detailedRatings.communication": null,
    "detailedRatings.condition": null,
    "reviewText": "I have not yet lived at my apartment for long now but hearing from others, he is extremely strict about getting back the money from our security deposits and purposefully overcharges us for minuscule things. In addition, he has been disregarding the Ithaca freeze or even the option to use our security deposit to pay the monthly rent, even though it was a state mandated order.",
    "date": "July 1, 2020"
  },
  {
    "id": 51,
    "aptId": null,
    "landlordId": 7,
    "overallRating": null,
    "detailedRatings.location": null,
    "detailedRatings.safety": null,
    "detailedRatings.value": null,
    "detailedRatings.maintenance": null,
    "detailedRatings.communication": null,
    "detailedRatings.condition": null,
    "reviewText": "Good experience but lied about the security deposit and didn't fix problems timely.",
    "date": "June 26, 2020"
  },
  {
    "id": 52,
    "aptId": null,
    "landlordId": 7,
    "overallRating": null,
    "detailedRatings.location": null,
    "detailedRatings.safety": null,
    "detailedRatings.value": null,
    "detailedRatings.maintenance": null,
    "detailedRatings.communication": null,
    "detailedRatings.condition": null,
    "reviewText": "Just terrible. The apartment wasn’t ready on move-in day, staff was verbally abusive to me, there were frequent maintenance issues that were slow to resolve including a bat infestation due to huge holes in outside and inside walls. They terrorized my blind cat, which to be fair is the bats’ direct fault, but I still blame PPM for letting them in through poor maintenance. The furnace broke several times during the winter, and their response was basically “yeah, it’s old, what can you do.” They did give me my full security deposit back on time though, which was good.",
    "date": "May 20, 2020"
  },
  {
    "id": 53,
    "aptId": null,
    "landlordId": 9,
    "overallRating": null,
    "detailedRatings.location": null,
    "detailedRatings.safety": null,
    "detailedRatings.value": null,
    "detailedRatings.maintenance": null,
    "detailedRatings.communication": null,
    "detailedRatings.condition": null,
    "reviewText": "My roommate and I get drastically different messages from different members of the family. I get pleasant, accommodating texts, and he only gets calls when rent is late from another individual. ",
    "date": "May 10, 2020"
  },
  {
    "id": 54,
    "aptId": null,
    "landlordId": 10,
    "overallRating": null,
    "detailedRatings.location": null,
    "detailedRatings.safety": null,
    "detailedRatings.value": null,
    "detailedRatings.maintenance": null,
    "detailedRatings.communication": null,
    "detailedRatings.condition": null,
    "reviewText": "Honestly they aren’t bad with repairs and stuff but it’s just a massive corporation. I was extremely disappointed with their response to COVID-19 basically offering no rent forgiveness programs outside of the 90 day eviction freeze. I know they don’t need the money, the company owns multiple buildings in Ithaca and shouldn’t be charging tenants for rent right now.",
    "date": "May 10, 2020"
  },
  {
    "id": 55,
    "aptId": null,
    "landlordId": 13,
    "overallRating": null,
    "detailedRatings.location": null,
    "detailedRatings.safety": null,
    "detailedRatings.value": null,
    "detailedRatings.maintenance": null,
    "detailedRatings.communication": null,
    "detailedRatings.condition": null,
    "reviewText": "Not loving it but I’ve also definitely had worse. They assisted a realtor to bug tenants to help her sell the house. We had to negotiate so she could get the pictures without coming into our home. We got pressure from both the realtor and the rental company to have her do her thing ASAP. Calls, texts, emails... I didn’t know this until recently, but when she contacted my boyfriend to talk about it she told him she was “totally safe” and had no trouble continuing business as usual “all over”. I didn’t hear the conversation, but this is what he told me. Realty is supposed to go back in the next phase... I didn’t know that and I didn’t get that from how persistent they were about it. I’ll report her 🤷🏻‍♀️",
    "date": "May 10, 2020"
  },
  {
    "id": 56,
    "aptId": null,
    "landlordId": 17,
    "overallRating": null,
    "detailedRatings.location": null,
    "detailedRatings.safety": null,
    "detailedRatings.value": null,
    "detailedRatings.maintenance": null,
    "detailedRatings.communication": null,
    "detailedRatings.condition": null,
    "reviewText": "Where do I begin? It's been the worst rental experience I've ever had. This is the same complex that had a building burn down in October 2019. I 100% regret moving here but it was the only place I could afford close to Cornell at the time of the year I needed to move.  Among the many issues:\n\nDeceptive rental practices - the apartment I leased did not resemble the condition of the apartments I was shown; the winter utility bills were twice what they estimated them to be. \n\nShoddy record keeping - my rental application had someone else's personal information including SSN in it. \n\nMove-in - the apartment was filthy, peeling paint, with extensive mold, holes in the walls, and many other issues. I refused to accept it and couldn't move in for a week until the major issues were resolved. It still took almost 4 months to get all repairs completed; the repairs often were ad hoc and required multiple efforts to be rectified. Though eventually the repairs got made, it really hasn't addressed the larger ongoing issues that are causing the rapid deterioration of the apartment, such as its extreme draftiness and mold/humidity issues. Other residents I spoke to said their apartments were filthy at move-in as well, and when they complained, the cleaning person returned with only single bleach wipe.\n\nUtter lack of fire safety - The smoke alarms are not wired to a central system because the building is older than, and exempt from, current fire code. So when the building burned down in 2019, no other units' smoke alarms went off and 911 was not automatically called. Management has not done ANYTHING to demonstrate an increased vigilance about fire safety. Upon my move-in, I encountered empty fire extinguishers in my unit and in the breezeway, I did not have the number of smoke detectors required by fire code, and I'm pretty sure my wired-in smoke detector doesn't detect smoke. I spoke to another resident who discovered the only smoke detector in his unit was located at floor level under his couch. Another resident told me they discovered their smoke detector didn't work when they accidentally started a stove fire. And a friend who works at the Red Cross fire safety hotline informed me they have fielded many, many calls from this complex's tenants concerned about a lack of functional smoke detectors. In addition, I confirmed with an electrical engineering friend that my appliances are wired in a manner that is non-compliant with building code. Meanwhile, the lease has several fire safety rules that I've observed are completely unenforced, such as a prohibition on grilling on patios/balconies.\n\n Ongoing - there is a drain backup issue that has necessitated many water shutoffs and repairs, and I am concerned whether it might increase the risk of transmission of COVID19 between units (speaking of which, one maintenance worker doesn't believe in wearing masks, so he wears a bandanna that he is constantly reaching under and fiddling with). There are persistent, serious hazards throughout the complex: dead tree limbs overhanging the parking lots, rotten wooden floor boards in the breezeways, deteriorated sidewalks, stairs, and handrails, protruding pieces of metal and wiring, and many other signs of neglect. The dumpsters are perpetually full of old appliances from renovations, causing trash to overflow them and the smell of garbage to waft through the complex, and yet management has  charges a $56 annual trash fee, the cost of which wasn't disclosed in the lease. \n\nLastly, the landlord himself. Despite all these issues, I believe I've only received one direct response from him no matter how many times I've cc'd him in emails. However, every maintenance team member I've met has told me it's best to avoid direct dealings with him and that he is a mean and unpleasant person.\n\nI am sharing this review so others don't make the same mistake as me and hopefully save some lives, because it seems inevitable that another fire will occur here.",
    "date": 1594166400000
  },
  {
    "id": 57,
    "aptId": null,
    "landlordId": 21,
    "overallRating": null,
    "detailedRatings.location": null,
    "detailedRatings.safety": null,
    "detailedRatings.value": null,
    "detailedRatings.maintenance": null,
    "detailedRatings.communication": null,
    "detailedRatings.condition": null,
    "reviewText": "Not particularly - very little contact except for notice from the landlord about house tours/maintenance things. The landlord has sent emails about the moving out process, but has said nothing in regards to meeting rent. ",
    "date": "May 10, 2020"
  },
  {
    "id": 58,
    "aptId": null,
    "landlordId": 21,
    "overallRating": null,
    "detailedRatings.location": null,
    "detailedRatings.safety": null,
    "detailedRatings.value": null,
    "detailedRatings.maintenance": null,
    "detailedRatings.communication": null,
    "detailedRatings.condition": null,
    "reviewText": "I would say that my landlord is good at keeping us updated on issues related to our lease. However, we have to email them multiple times in order to get meaningful action on our maintenance requests. For example, in my old apartment (which was also rented from PJ) our dryer broke beyond repair and it took several months of maintenance requests and half-hearted attempts to fix the machine before they gave in and replaced it. This was a big inconvenience for me and my (7) roommates, especially because one of them had allergies that required her to wash her linens weekly.",
    "date": "May 20, 2020"
  },
  {
    "id": 59,
    "aptId": null,
    "landlordId": 26,
    "overallRating": null,
    "detailedRatings.location": null,
    "detailedRatings.safety": null,
    "detailedRatings.value": null,
    "detailedRatings.maintenance": null,
    "detailedRatings.communication": null,
    "detailedRatings.condition": null,
    "reviewText": "He became increasingly hostile toward my roommate and I in our last few months of tenancy. We had signed the lease for the following year but due to his complaints of our noise and not sharing the driveway properly after a snowstorm, I left the apartment months earlier than I had leased it for. Luckily he agreed to end my lease when I moved out but he did not give me the security deposit back for some damages and some ridiculous reasons. Either way, he was a terrible communicator and I worry he will continue to take advantage of his tenants",
    "date": "May 10, 2020"
  },
  {
    "id": 60,
    "aptId": null,
    "landlordId": 27,
    "overallRating": null,
    "detailedRatings.location": null,
    "detailedRatings.safety": null,
    "detailedRatings.value": null,
    "detailedRatings.maintenance": null,
    "detailedRatings.communication": null,
    "detailedRatings.condition": null,
    "reviewText": "Our landlords are now trying to take away our deposit for a break-in that occurred while no one was in Ithaca (since we’re quarantined back home). They were the last ones to come in the house and they should be help responsible for that breakin, since they could have left the door open. They are claiming that “they would never do that” and absolving themselves of all responsibility. It is upsetting enough that we’ve had to pay rent even though we all evacuated from the house due to the pandemic but two weeks prior to us getting our deposit back they are trying to scam us for more money. ",
    "date": "July 14, 2020"
  },
  {
    "id": 61,
    "aptId": null,
    "landlordId": 28,
    "overallRating": null,
    "detailedRatings.location": null,
    "detailedRatings.safety": null,
    "detailedRatings.value": null,
    "detailedRatings.maintenance": null,
    "detailedRatings.communication": null,
    "detailedRatings.condition": null,
    "reviewText": "She's really intense about doing chores 50/50. She keeps a spreadsheet of cleaning tasks that we both do each week, and has emailed me about missing chores months ago so I would do extra chores to make up for it. She's started keeping a record of our outdoor chores, including recording when she shovels snow WITH the amount of inches that it snowed. She's quick to monetize mistakes that I make such as getting hair dye on her hand towel and asking me to reimburse her for it. Living with her gives me anxiety, it's an unhealthy dynamic but I'm moving out in two weeks so it's the light at the end of the tunnel.",
    "date": "May 16, 2020"
  },
  {
    "id": 62,
    "aptId": null,
    "landlordId": 29,
    "overallRating": null,
    "detailedRatings.location": null,
    "detailedRatings.safety": null,
    "detailedRatings.value": null,
    "detailedRatings.maintenance": null,
    "detailedRatings.communication": null,
    "detailedRatings.condition": null,
    "reviewText": "A perfect example of how Ithaca's housing market is structured to leech students. After moving into a filthy house overflowing with trash and rotting food, the landlord has the audacity to accuse us as the reason that the house has \"never been this dirty\". Frankly, she should be grateful we managed to clean the house as much as we did; it is a disgusting decaying ancient property and only in Ithaca could it fetch as much rent as it does. Due to our rigorous cleaning, it certainly looks better than it did when we moved in. The heat and thermostats malfunctioned for most of the year, leaving some bedrooms 80 degrees or higher, virtually unlivable, and despite multiple requests, this was not resolved. Now she is withholding our security deposits based on a couple pictures of a stained refrigerator until we pay for professional cleaning--I am furious but sadly unsurprised that even in a pandemic situation, landlords are going out of their way to squeeze every possible cent from student tenants.",
    "date": "June 14, 2020"
  },
  {
    "id": 63,
    "aptId": null,
    "landlordId": 30,
    "overallRating": null,
    "detailedRatings.location": null,
    "detailedRatings.safety": null,
    "detailedRatings.value": null,
    "detailedRatings.maintenance": null,
    "detailedRatings.communication": null,
    "detailedRatings.condition": null,
    "reviewText": "Melissa had promised certain maintenance issues would be fixed (porch repair and window repair in the kitchen, for example) prior to move-in, but did not deliver on her promises as written in the lease. She had a maintenance person she knew and his teenage son come to do repairs in the house late at night, creating a mess in the house that he did not clean up and making it unable for us to find comfort in the house after work. She did not give ample warning when he came to work on the house, often letting us know a few hours before he planned to show up (if he showed up at all). As issues mounted and Melissa did not have work done on the house in a timely manner, I and my roommates requested copies of our lease (in case we needed to take legal action) and she gave us our copies while cursing at us and saying that she had never had tenants ask for copies of the lease before. While showing the apartment to prospective tenants, Melissa also lied when answering questions about pests in the house, telling someone that there had never been issues with pests when we had repeatedly emailed her about an issue with mice in the apartment. As well, upon moving into the apartment, I and my roommates discovered that the bathroom had large amounts of black mold in it that Melissa had not thought to have cleaned. I would not recommend renting from this landlord at all.",
    "date": "June 16, 2020"
  },
  {
    "id": 64,
    "aptId": null,
    "landlordId": 31,
    "overallRating": null,
    "detailedRatings.location": null,
    "detailedRatings.safety": null,
    "detailedRatings.value": null,
    "detailedRatings.maintenance": null,
    "detailedRatings.communication": null,
    "detailedRatings.condition": null,
    "reviewText": "They still have the previous tenant (Sam Mason) as the contact person so I never hear about repairs or any other tenant memos. Sassy, willing to  make tenant-by-tenant agreements, never followed up after unemployment kicked in. ",
    "date": "May 10, 2020"
  },
  {
    "id": 65,
    "aptId": null,
    "landlordId": 24,
    "overallRating": null,
    "detailedRatings.location": null,
    "detailedRatings.safety": null,
    "detailedRatings.value": null,
    "detailedRatings.maintenance": null,
    "detailedRatings.communication": null,
    "detailedRatings.condition": null,
    "reviewText": "A few \"that was just barely 24 hours notice\" entry incidents the first couple months we lived here, but he stopped those fast. Otherwise largely positive until the past month.",
    "date": "May 10, 2020"
  },
  {
    "id": 66,
    "aptId": null,
    "landlordId": 33,
    "overallRating": null,
    "detailedRatings.location": null,
    "detailedRatings.safety": null,
    "detailedRatings.value": null,
    "detailedRatings.maintenance": null,
    "detailedRatings.communication": null,
    "detailedRatings.condition": null,
    "reviewText": "I've literally never met him, I know he owns at least 300 units. Repairs are quick and dirty, but quick at least. Was pushed to pay April rent, am now ignoring their requests for May.",
    "date": "May 20, 2020"
  },
  {
    "id": 67,
    "aptId": 14.0,
    "landlordId": 4,
    "overallRating": 4.0,
    "detailedRatings.location": 3.0,
    "detailedRatings.safety": 5.0,
    "detailedRatings.value": 4.0,
    "detailedRatings.maintenance": 5.0,
    "detailedRatings.communication": 4.0,
    "detailedRatings.condition": 5.0,
    "reviewText": "CTT is a very nice apartment complex. Some people might think it's too far away from campus, but it's not too bad if you use the shuttle bus that runs every 10 minutes in the morning. The price is relatively reasonable compared to the apartments in Collegetown, we have huge parking spaces, there are washer-dryer units built in, there are compost grinders in every kitchen sink.",
    "date": "October 14, 2021"
  },
  {
    "id": 68,
    "aptId": 14.0,
    "landlordId": 4,
    "overallRating": 4.0,
    "detailedRatings.location": 2.0,
    "detailedRatings.safety": 4.0,
    "detailedRatings.value": 4.0,
    "detailedRatings.maintenance": 4.0,
    "detailedRatings.communication": 3.0,
    "detailedRatings.condition": 5.0,
    "reviewText": "Very clean and great quality, but a bit far from Campus. ",
    "date": "October 14, 2021"
  },
  {
    "id": 69,
    "aptId": 84.0,
    "landlordId": 10,
    "overallRating": 4.0,
    "detailedRatings.location": 5.0,
    "detailedRatings.safety": 4.0,
    "detailedRatings.value": 4.0,
    "detailedRatings.maintenance": 3.0,
    "detailedRatings.communication": 5.0,
    "detailedRatings.condition": 3.0,
    "reviewText": "It is really convenient for campus, and nominally it is one of the cheapest you can get for this location; however, the value is definitely still not worth the rent. The apartment is aging, the bathrooms are designed weird, and the kitchen appliances are barely able to cook. ",
    "date": "October 14, 2021"
  },
  {
    "id": 70,
    "aptId": 14.0,
    "landlordId": 4,
    "overallRating": 4.0,
    "detailedRatings.location": 2.0,
    "detailedRatings.safety": 4.0,
    "detailedRatings.value": 4.0,
    "detailedRatings.maintenance": 4.0,
    "detailedRatings.communication": 3.0,
    "detailedRatings.condition": 4.0,
    "reviewText": "The cons is that it is bit far away from the campus. I can not go back to my house if I leave something there since it takes more than 40 minutes to go back and come. Also, there is no concierge, so we have to manually pick up our package. The pro is that price is reasonable and cheap relative to its fairly good facilities. I love how it is modern and the laundry system is inside house. This is very convenient. ",
    "date": "October 14, 2021"
  },
  {
    "id": 71,
    "aptId": 240.0,
    "landlordId": 35,
    "overallRating": 4.0,
    "detailedRatings.location": 3.0,
    "detailedRatings.safety": 4.0,
    "detailedRatings.value": 4.0,
    "detailedRatings.maintenance": 4.0,
    "detailedRatings.communication": 5.0,
    "detailedRatings.condition": 4.0,
    "reviewText": "Overall, location isn't the best (have to walk up a slight slope) but not too far from campus. Neighbors can be loud as well but that's only on certain days of the year. Really like the amount of space for the price though and the apartment layout is really roomy.",
    "date": "October 14, 2021"
  },
  {
    "id": 72,
    "aptId": 14.0,
    "landlordId": 4,
    "overallRating": 5.0,
    "detailedRatings.location": 3.0,
    "detailedRatings.safety": 5.0,
    "detailedRatings.value": 5.0,
    "detailedRatings.maintenance": 5.0,
    "detailedRatings.communication": 5.0,
    "detailedRatings.condition": 5.0,
    "reviewText": "Amazing living experience",
    "date": "October 14, 2021"
  },
  {
    "id": 73,
    "aptId": 241.0,
    "landlordId": 36,
    "overallRating": 5.0,
    "detailedRatings.location": 3.0,
    "detailedRatings.safety": 5.0,
    "detailedRatings.value": 5.0,
    "detailedRatings.maintenance": 5.0,
    "detailedRatings.communication": 5.0,
    "detailedRatings.condition": 4.0,
    "reviewText": "I have really enjoyed living in this house! It is a great place for a large group of friends, and a very cozy house! Totally recommend living here if you are up for a little bit of a commute to campus (off of North). Also a very affordable price!",
    "date": "October 14, 2021"
  },
  {
    "id": 74,
    "aptId": 242.0,
    "landlordId": 37,
    "overallRating": 5.0,
    "detailedRatings.location": 5.0,
    "detailedRatings.safety": 5.0,
    "detailedRatings.value": 5.0,
    "detailedRatings.maintenance": 5.0,
    "detailedRatings.communication": 5.0,
    "detailedRatings.condition": 5.0,
    "reviewText": "Great location, Good Price, Friendly owners that are very accommodating. Utilities are included. Quiet neighborhood that is perfect for grad students.",
    "date": "October 15, 2021"
  },
  {
    "id": 75,
    "aptId": null,
    "landlordId": 10,
    "overallRating": 3.0,
    "detailedRatings.location": 5.0,
    "detailedRatings.safety": 5.0,
    "detailedRatings.value": 3.0,
    "detailedRatings.maintenance": 4.0,
    "detailedRatings.communication": 3.0,
    "detailedRatings.condition": 2.0,
    "reviewText": "The best part of the apartment is its location, in the center of college town and with 5-10 minute walk to campus. The building is old and some furnitures are broken. There is only one trash room in the entire building and trash often overflows (especially in weekends). The pricing is fair for its location. ",
    "date": "October 15, 2021"
  },
  {
    "id": 76,
    "aptId": 173.0,
    "landlordId": 21,
    "overallRating": 4.0,
    "detailedRatings.location": 4.0,
    "detailedRatings.safety": 4.0,
    "detailedRatings.value": 4.0,
    "detailedRatings.maintenance": 4.0,
    "detailedRatings.communication": 4.0,
    "detailedRatings.condition": 4.0,
    "reviewText": "It's nice and spacious. Ceilings are high so it makes it feel more home-y. Provided furniture is extremely comfortable and livable. Rooms are decent size with good doors and windows (they aren't broken) and each room has a closet space. Kitchen is decently large with a lot of cabinets and bathrooms are a little small but there are two full bathrooms which is really nice for a group of 4. In-unit laundry is amazing.",
    "date": "October 15, 2021"
  },
  {
    "id": 77,
    "aptId": 215.0,
    "landlordId": 24,
    "overallRating": 4.0,
    "detailedRatings.location": 4.0,
    "detailedRatings.safety": 5.0,
    "detailedRatings.value": 4.0,
    "detailedRatings.maintenance": 4.0,
    "detailedRatings.communication": 3.0,
    "detailedRatings.condition": 5.0,
    "reviewText": "It’s slightly down the slope but at least it’s close to West Campus and right next to a bus stop. The building itself is fine, and the office is reachable during working hours. Maintenance takes a while. Overall, it’s a good spot.",
    "date": "October 16, 2021"
  },
  {
    "id": 78,
    "aptId": 129.0,
    "landlordId": 16,
    "overallRating": 4.0,
    "detailedRatings.location": 2.0,
    "detailedRatings.safety": 4.0,
    "detailedRatings.value": 4.0,
    "detailedRatings.maintenance": 4.0,
    "detailedRatings.communication": 4.0,
    "detailedRatings.condition": 4.0,
    "reviewText": "Pretty happy with the apartment, I like everything about the apartment except the location but even then the shuttle runs during the week and early during the weekend. Kind of annoying if you need to go to CTOWN during the weekend. ",
    "date": "October 18, 2021"
  },
  {
    "id": 79,
    "aptId": 244.0,
    "landlordId": 39,
    "overallRating": 4.0,
    "detailedRatings.location": 5.0,
    "detailedRatings.safety": 5.0,
    "detailedRatings.value": 4.0,
    "detailedRatings.maintenance": 4.0,
    "detailedRatings.communication": 5.0,
    "detailedRatings.condition": 3.0,
    "reviewText": "Maintenance is really fast and the staff are really nice. The only problem is the price of rent.",
    "date": "October 30, 2021"
  },
  {
    "id": 80,
    "aptId": 124.0,
    "landlordId": 10,
    "overallRating": 3.0,
    "detailedRatings.location": 4.0,
    "detailedRatings.safety": 3.0,
    "detailedRatings.value": 3.0,
    "detailedRatings.maintenance": 2.0,
    "detailedRatings.communication": 4.0,
    "detailedRatings.condition": 2.0,
    "reviewText": "the best part about aces apartment is the location and it’s proximity to everything in ctown and campus, but the building itself is extremely old and you should definitely keep this in mind when deciding to move in or not! the rooms are also very different in size and quality (noise-wise as well) so keep this in mind!!",
    "date": "October 30, 2021"
  },
  {
    "id": 81,
    "aptId": 84.0,
    "landlordId": 10,
    "overallRating": 3.0,
    "detailedRatings.location": 5.0,
    "detailedRatings.safety": 4.0,
    "detailedRatings.value": 3.0,
    "detailedRatings.maintenance": 3.0,
    "detailedRatings.communication": 5.0,
    "detailedRatings.condition": 3.0,
    "reviewText": "Cleanliness of apartment depends on which unity you lease. Highly recommend viewing the unit before leasing. Certain things such as shower door were broken. ",
    "date": "October 30, 2021"
  },
  {
    "id": 82,
    "aptId": 173.0,
    "landlordId": 21,
    "overallRating": 4.0,
    "detailedRatings.location": 4.0,
    "detailedRatings.safety": 4.0,
    "detailedRatings.value": 4.0,
    "detailedRatings.maintenance": 4.0,
    "detailedRatings.communication": 3.0,
    "detailedRatings.condition": 4.0,
    "reviewText": "The apartment is amazing for its relative price and location. It’s close to campus (besides a hill) and it has a very homey vibe. There are multiple units to the house, so your experience will vary based on your neighbors. The landlord is good on communication but is unavailable on weekends. Overall, great place to stay with friends, but the hill is a battle to go up. ",
    "date": "October 30, 2021"
  },
  {
    "id": 83,
    "aptId": 243.0,
    "landlordId": 38,
    "overallRating": 4.0,
    "detailedRatings.location": 5.0,
    "detailedRatings.safety": 5.0,
    "detailedRatings.value": 4.0,
    "detailedRatings.maintenance": 3.0,
    "detailedRatings.communication": 5.0,
    "detailedRatings.condition": 4.0,
    "reviewText": "This is one of the best apartments in Collegetown. However, I have faced a few bug problems, such as a few spiders and a worm or two when it rained. Overall though, the place is clean, quiet, and has a great location.",
    "date": "October 30, 2021"
  }
]
