[
  {
    "id": 3,
    "aptId": 237,
    "landlordId": 14,
    "overallRating": 5,
    "detailedRatings.location": 5,
    "detailedRatings.safety": 4,
    "detailedRatings.maintenance": 4,
    "detailedRatings.condition": 4,
    "reviewText": "I've really enjoyed this apartment. I lived in an apartment of 6 and it was still quite spacious for us. My only gripes would be the kitchen is a little too small for 6 people and the drying/washer machines are kind of weak.",
    "date": "April 10, 2021"
  },
  {
    "id": 4,
    "aptId": 238,
    "landlordId": 15,
    "overallRating": 5,
    "detailedRatings.location": 5,
    "detailedRatings.safety": 4,
    "detailedRatings.maintenance": 5,
    "detailedRatings.condition": 4,
    "reviewText": "I've enjoyed my time living at 312 College Ave. The rent is high but you do get what you pay for. The location is good and I've had no complaints about the staff, maintenance, security, or anything like that. Utilities except for electricity are also covered. My kitchen was recently upgraded for free which is a plus. My only problem with this apartment is its price.",
    "date": "March 31, 2021"
  },
  {
    "id": 5,
    "aptId": 129,
    "landlordId": 16,
    "overallRating": 4,
    "detailedRatings.location": 1,
    "detailedRatings.safety": 3,
    "detailedRatings.maintenance": 4,
    "detailedRatings.condition": 4,
    "reviewText": "I enjoy the cheap, affordable living space as well as the cheap parking. However, it is too far from campus and Collegetown, and there is an extra slope to walk up in order to go anywhere.",
    "date": "March 31, 2021"
  },
  {
    "id": 6,
    "aptId": 107,
    "landlordId": 12,
    "overallRating": 4,
    "detailedRatings.location": 4,
    "detailedRatings.safety": 4,
    "detailedRatings.maintenance": 4,
    "detailedRatings.condition": 4,
    "reviewText": "Pretty spacious, reasonable rent price, and an overall good place to live! It's pretty close to Collegetown so location is also convenient. Apartment was pretty clean when we moved in!",
    "date": "March 30, 2021"
  },
  {
    "id": 7,
    "aptId": 107,
    "landlordId": 12,
    "overallRating": 3,
    "detailedRatings.location": 4,
    "detailedRatings.safety": 4,
    "detailedRatings.maintenance": 2,
    "detailedRatings.condition": 3,
    "reviewText": "Overall my experience has been pretty good outside of maintenance issues. The location is very close to campus and the apartment is quite spacious for something at this price point. Furthermore, since the apartment is mirrored, we have two of everything, like kitchens, appliances, bathrooms, etc. which is quite convenient. If you're not worried about having the nicest apartment or dealing with maintenance, it is a fine apartment!",
    "date": "March 30, 2021"
  },
  {
    "id": 8,
    "aptId": 64,
    "landlordId": 8,
    "overallRating": 4,
    "detailedRatings.location": 4,
    "detailedRatings.safety": 4,
    "detailedRatings.maintenance": 5,
    "detailedRatings.condition": 5,
    "reviewText": "Great location to everything and right above Greenstar. Everything is good and the rooms are really pretty. Floors are very sturdy so you can exercise in it. Walls are kind of thin and you can hear roommates. Bathroom and kitchen facilities are average. Rooms are really big but the shared living space is smaller than expected. The major downside I have of the apartment is that I live on the college avenue side on the 2nd floor so I can hear everything outside. It is really annoying and wakes me up in the morning and keeps up at night. If it was a normal semester it would be 100x more annoying with the parties in Collegetown. It is a good apartment, but I do not think it is worth the price. Also, I would not live in the same room again because the noise from the street was too annoying. I think people in other locations of the apartment wouldn't have that complaint though.",
    "date": "March 31, 2021"
  },
  {
    "id": 9,
    "aptId": 14,
    "landlordId": 4,
    "overallRating": 4,
    "detailedRatings.location": 4,
    "detailedRatings.safety": 4,
    "detailedRatings.maintenance": 5,
    "detailedRatings.condition": 5,
    "reviewText": "I think overall it's pretty good but during COVID-19, they are not being very understanding. For example, many international students weren't able to travel back to Ithaca and they hoped to defer or terminate the lease. However, the CTT staff won't allow termination of lease at all and we must sublet the house with a lower rate by ourselves. At the same time, they allowed certain tenants to defer the lease, which is very unfair and confusing.",
    "date": "March 31, 2021"
  },
  {
    "id": 10,
    "aptId": 235,
    "landlordId": 32,
    "overallRating": 2,
    "detailedRatings.location": 4,
    "detailedRatings.safety": 3,
    "detailedRatings.maintenance": 2,
    "detailedRatings.condition": 1,
    "reviewText": "The landlord is very hard to deal with. When I first moved in she said she cleaned the apartment and shampooed the carpets before our move in date, but it was very clear that she did neither; the carpets had large stains all over them and the apartment didn't look like it had been cleaned anytime recently. In the begining of the fall semester, she scheduled a tour without letting us know and people just randomly and unexpectedly walked into the apartment. Besides that, the apartment is not well maintained. It needs new furniture and the carpets need to be cleaned. I would not recommend this place to anyone.",
    "date": "April 3, 2021"
  },
  {
    "id": 11,
    "aptId": 235,
    "landlordId": 32,
    "overallRating": 1,
    "detailedRatings.location": 4,
    "detailedRatings.safety": 3,
    "detailedRatings.maintenance": 1,
    "detailedRatings.condition": 1,
    "reviewText": "Overall, the apartment itself is spacious and in a good location a 15 min walk to campus. It had the potential to be a good apt because of its space and location but all the other issues made the experience really bad. The landlord was often rude and not understanding; she made us pay 7 months of rent (2 months security deposit and 5 months shortly after) before our lease started and before we even got the keys. At the time, the pandemic had just started and everything was up in the air, and we didn't know what our plans were, and she was threatening to press charges a whole week before the 5 months of rent was even due.",
    "date": "April 10, 2021"
  },
  {
    "id": 12,
    "aptId": 123,
    "landlordId": 13,
    "overallRating": 5,
    "detailedRatings.location": 5,
    "detailedRatings.safety": 5,
    "detailedRatings.maintenance": 5,
    "detailedRatings.condition": 5,
    "date": "March 30, 2021"
  },
  {
    "id": 13,
    "aptId": 42,
    "landlordId": 6,
    "overallRating": 3,
    "detailedRatings.location": 4,
    "detailedRatings.safety": 5,
    "detailedRatings.maintenance": 4,
    "detailedRatings.condition": 4,
    "reviewText": "The landlord is pretty nice, and the location and living conditions are decent. The views outside the window are not great though, and the price is a bit steep (probably because of the location). Rent needs to be paid via check, which is inconvenient if you're not in Ithaca. Trash and laundry are not included in the rent, and if you need parking you need to buy a spot through a third party.",
    "date": "March 29, 2021"
  },

  {
    "id": 15,
    "aptId": 91,
    "landlordId": 10,
    "overallRating": 3,
    "detailedRatings.location": 4,
    "detailedRatings.safety": 5,
    "detailedRatings.maintenance": 5,
    "detailedRatings.condition": 3,
    "reviewText": "Pretty good - kind of rough for corona since it is a little small at times and Ithaca collegetown kids do pull up outside late at night because it's on a more major road.",
    "date": "April 4, 2021"
  },
  {
    "id": 16,
    "aptId": 84,
    "landlordId": 10,
    "overallRating": 5,
    "detailedRatings.location": 5,
    "detailedRatings.safety": 4,
    "detailedRatings.maintenance": 4,
    "detailedRatings.condition": 5,
    "reviewText": "Despite the rather expensive pricing, the location (right in the heart of Collegetown) covers most of the small issues. Plus, although this might be a unique advantage of high floor apartments, the street noise is nearly inaudible.",
    "date": "April 8, 2021"
  },
  {
    "id": 17,
    "aptId": 86,
    "landlordId": 10,
    "overallRating": 4,
    "detailedRatings.location": 4,
    "detailedRatings.safety": 4,
    "detailedRatings.maintenance": 4,
    "detailedRatings.condition": 4,
    "reviewText": "Pretty good, staff are friendly and responsive. The rent is pretty reasonable compare to other apartments in college town. Super convenient, everything is right downstairs. Need to pick up packages from ithaca renting office.",
    "date": "April 10, 2021"
  },
  {
    "id": 18,
    "aptId": 89,
    "landlordId": 10,
    "overallRating": 4,
    "detailedRatings.location": 5,
    "detailedRatings.safety": 4,
    "detailedRatings.maintenance": 4,
    "detailedRatings.condition": 3,
    "date": "April 10, 2021"
  },
  {
    "id": 19,
    "aptId": 86,
    "landlordId": 10,
    "overallRating": 4,
    "detailedRatings.location": 5,
    "detailedRatings.safety": 5,
    "detailedRatings.maintenance": 4,
    "detailedRatings.condition": 4,
    "reviewText": "The apartment is decently prices and the location is great. The only downside is that we need to physically go to the office to pick up our packages. Maintenance sometimes takes a long time.",
    "date": "April 10, 2021"
  },
  {
    "id": 20,
    "aptId": 84,
    "landlordId": 10,
    "overallRating": 4,
    "detailedRatings.location": 4,
    "detailedRatings.safety": 4,
    "detailedRatings.maintenance": 4,
    "detailedRatings.condition": 4,
    "reviewText": "The apartment is good and I enjoy living here because of its closeness to the campus, good maintenance and closeness to restaurants/stores. The landlord are friendly and send out timely emails about important notices, package arrivals and any such details. While everything is comfortable, sometimes it feels a bit small compared to the price I pay. Overall, I enjoy living here and it's a great place for roommates.",
    "date": "April 10, 2021"
  },
  {
    "id": 21,
    "aptId": 94,
    "landlordId": 10,
    "overallRating": 3,
    "detailedRatings.location": 4,
    "detailedRatings.safety": 4,
    "detailedRatings.maintenance": 3,
    "detailedRatings.condition": 2,
    "reviewText": "This apartment is generally very old. There are some wear-downs in the apartment, but the maintenance service is relatively quick and communicates well. There is not much ventilation in the apartment so it gets quite hot in the summer. The rent is ok, not too high not too low. There is a deli right downstairs (very convenient for snacks :) )",
    "date": "April 10, 2021"
  },
  {
    "id": 22,
    "aptId": 211,
    "landlordId": 10,
    "overallRating": 5,
    "detailedRatings.location": 5,
    "detailedRatings.safety": 3,
    "detailedRatings.maintenance": 5,
    "detailedRatings.condition": 4,
    "reviewText": "I feel like I live pretty close to everyone I know. It's not that far from campus either. I really like having my own kitchen and bathroom. It's so close to the engineering quad and Starbucks, so it's been really convenient",
    "date": "March 31, 2021"
  },
  {
    "id": 23,
    "aptId": 131,
    "landlordId": 17,
    "overallRating": 4,
    "detailedRatings.location": 3,
    "detailedRatings.safety": 5,
    "detailedRatings.maintenance": 5,
    "detailedRatings.condition": 4,
    "reviewText": "The quality price ratio is very good. It's a quiet neighborhood and the layout is not bad. I can get to the main campus within 20 min walk and there's also a bus stop around. The room is not big but it's good enough for me. The landlord provides all necessary furnitures including a microwave, a fridge, and a tv. We don't need to pay anything extra except for the electricity bill. They are also super responsive to our maintenance requests. The layout is a bit weird. The bedrooms are right next to the living room so sometimes it can be a bit distracting when your roommates are hanging out while you need to do work, but this can happen in other places as well and I can just solve it with earbuds. Overall, not the best apartment out there but there's nothing bad about it. Plus the price is super good.",
    "date": "April 10, 2021"
  },
  {
    "id": 24,
    "aptId": 140,
    "landlordId": 18,
    "overallRating": 5,
    "detailedRatings.location": 5,
    "detailedRatings.safety": 5,
    "detailedRatings.maintenance": 4,
    "detailedRatings.condition": 5,
    "reviewText": "I've had a great time overall and would recommend living here, it's just expensive but most of the time it's quiet, but the noise from neighbors still gets through. It's way more loud in the center of collegetown anyway. I would say it's one of the cleanest and well maintained buildings I saw during my tours and I enjoy living there right now.",
    "date": "April 10, 2021"
  },

  {
    "id": 28,
    "aptId": 165,
    "landlordId": 20,
    "overallRating": 5,
    "detailedRatings.location": 4,
    "detailedRatings.safety": 5,
    "detailedRatings.maintenance": 5,
    "detailedRatings.condition": 5,
    "reviewText": "I've loved living here and I've had an amazing experience with the landlords as well. Despite being far, it is a great price and the bus stop makes up for it. I'm planning to stay for the next 2 years :))",
    "date": "April 10, 2021"
  },
  {
    "id": 29,
    "aptId": 170,
    "landlordId": 20,
    "overallRating": 5,
    "detailedRatings.location": 4,
    "detailedRatings.safety": 5,
    "detailedRatings.maintenance": 5,
    "detailedRatings.condition": 4,
    "reviewText": "Easy access to laundry and trash. Utilities included, which is a plus. Maintenance is really easy to get done and payments can be made online. Overall great landlord / apartment. Also pet friendly!",
    "date": "April 10, 2021"
  },
  {
    "id": 30,
    "aptId": 14,
    "landlordId": 4,
    "overallRating": 4,
    "detailedRatings.location": 3,
    "detailedRatings.safety": 4,
    "detailedRatings.maintenance": 5,
    "detailedRatings.condition": 5,
    "reviewText": "CTT is the perfect place to live in terms of facilities and price, if not considering accessibility. However, there is a shuttle which runs every 20 min in the morning (used to be 10 min pre-covid) and once every hour in the afternoon until 4:15pm. There's also a dryer and a washing machine in your room.",
    "date": "March 30, 2021"
  },
  {
    "id": 31,
    "aptId": 14,
    "landlordId": 4,
    "overallRating": 4,
    "detailedRatings.location": 3,
    "detailedRatings.safety": 5,
    "detailedRatings.maintenance": 4,
    "detailedRatings.condition": 4,
    "reviewText": "The landlord sometimes seems to be predatory, even when it comes to your lease. They openly say that they will rent your apartment out from under you without notification. I assume as a play to attempt to get tenants to renew their leases. I wouldn't bite at any of these tactics.\n\nBeyond this, I haven't had any problems with safety or cleanliness. They have covered parking under the building, which is my main reason for choosing the apartment.",
    "date": "April 10, 2021"
  },
  {
    "id": 32,
    "aptId": 175,
    "landlordId": 21,
    "overallRating": 5,
    "detailedRatings.location": 4,
    "detailedRatings.safety": 3,
    "detailedRatings.maintenance": 4,
    "detailedRatings.condition": 4,
    "reviewText": "I really enjoyed the fact that it came with plants, couch, and the whole furniture setup. I think the hill might be the worst part in terms of getting to the house but the house itself is nice. Really big closets, washer, dryer, dishwasher etc.",
    "date": "March 31, 2021"
  },
  {
    "id": 33,
    "aptId": 149,
    "landlordId": 22,
    "overallRating": 4,
    "detailedRatings.location": 4,
    "detailedRatings.safety": 4,
    "detailedRatings.maintenance": 4,
    "detailedRatings.condition": 4,
    "reviewText": "I like staying at this apartment and have made myself at home here. I don't regret choosing this apartment and would choose to stay here again if I were a freshman again. The landlord and management are quite nice and did not do anything unethical. The location of this apartment is quite nice and we're close to a bus route. The only downside to this apartment is that it's dated. However, this apartment is comfortable and I like it here.",
    "date": "March 31, 2021"
  },
  {
    "id": 34,
    "aptId": 201,
    "landlordId": 23,
    "overallRating": 4,
    "detailedRatings.location": 4,
    "detailedRatings.safety": 3,
    "detailedRatings.maintenance": 5,
    "detailedRatings.condition": 4,
    "reviewText": "This apartment is pretty satisfactory. The utilities seem to be pretty high (in the winter it is above $100). The walls and floors are super thin, however, and I can hear basically everything happening in the apartment above and next to ours... Other than that, it's a nice place to call home.",
    "date": "March 31, 2021"
  },
  {
    "id": 35,
    "aptId": 211,
    "landlordId": 24,
    "overallRating": 4,
    "detailedRatings.location": 5,
    "detailedRatings.safety": 4,
    "detailedRatings.maintenance": 3,
    "detailedRatings.condition": 3,
    "reviewText": "Overall, it's a very good location. The apartment is average quality, nothing special but also nothing really bad either. I'm moving to another apartment next semester because this 3 bedroom apartment is too small for 5 people, and all of us wanted our own rooms. It's pretty good for the rent we pay, but obviously it comes at a cost.",
    "date": "March 30, 2021"
  },
  {
    "id": 36,
    "aptId": 215,
    "landlordId": 24,
    "overallRating": 3,
    "detailedRatings.location": 3,
    "detailedRatings.safety": 2,
    "detailedRatings.maintenance": 3,
    "detailedRatings.condition": 3,
    "reviewText": "The location isn't ideal and well there are definitely many more places that are in better condition/have better facilities, but the apartment is big and I get to live with many other friends and we have a fairly big living room that we play games in on a daily basis so I dont regret my choice.",
    "date": "April 10, 2021"
  },
  {
    "id": 37,
    "aptId": 211,
    "landlordId": 24,
    "overallRating": 4,
    "detailedRatings.location": 5,
    "detailedRatings.safety": 5,
    "detailedRatings.maintenance": 4,
    "detailedRatings.condition": 4,
    "reviewText": "Nice living experience with my best friends. We had a lot of great memories there.\nBut the move-out experience was terrible: because of COVID, my roommates and I all move out in March (2 months before the lease ended). We tried to negotiate a deduction of rent but the leasing company did nothing to help. Also, more than half of our deposit was deducted because of very expensive cleaning fees :(((",
    "date": "April 6, 2021"
  },
  {
    "id": 38,
    "aptId": 211,
    "landlordId": 24,
    "overallRating": 4,
    "detailedRatings.location": 5,
    "detailedRatings.safety": 5,
    "detailedRatings.maintenance": 4,
    "detailedRatings.condition": 4,
    "reviewText": "The location is wonderful, the heater is excellent, and all the essential services are provided (laundry, trash, bug extermination, etc.) The only thing is our wifi was a bit spotty sometimes because of the location of our apartment, but it was a minor inconvenience.",
    "date": "April 10, 2021"
  },
  {
    "id": 39,
    "aptId": 64,
    "landlordId": 8,
    "overallRating": 5,
    "detailedRatings.location": 5,
    "detailedRatings.safety": 5,
    "detailedRatings.maintenance": 5,
    "detailedRatings.condition": 5,
    "reviewText": "The experience is very good. The apartment looks very nice, with big rooms and big beds. The biggest issue is price, which sucks in more than 2/3 of my internship income :(((",
    "date": "April 5, 2021"
  },
  {
    "id": 40,
    "aptId": 72,
    "landlordId": 8,
    "overallRating": 3,
    "detailedRatings.location": 4,
    "detailedRatings.safety": 3,
    "detailedRatings.maintenance": 2,
    "detailedRatings.condition": 2,
    "reviewText": "The people who run Urban Ithaca aren't the best. But, Brad the maintenance man is a goat. The housing is definitely overpriced. And the inside is old and outdated. But, the space and location is nice.",
    "date": "April 10, 2021"
  },
  {
    "id": 41,
    "aptId": 236,
    "landlordId": 8,
    "overallRating": 4,
    "detailedRatings.location": 5,
    "detailedRatings.safety": 4,
    "detailedRatings.maintenance": 3,
    "detailedRatings.condition": 4,
    "reviewText": "Location is extremely hard to beat! 2 minute walk away from CTB and 3 minutes away from campus. Although the real estate company can do a better job of communicating with us about lease agreements and fines, I would say the house itself is really great for what it is.",
    "date": "April 10, 2021"
  },
  {
    "id": 42,
    "aptId": 231,
    "landlordId": 25,
    "overallRating": 3,
    "detailedRatings.location": 3,
    "detailedRatings.safety": 4,
    "detailedRatings.maintenance": 3,
    "detailedRatings.condition": 2,
    "reviewText": "I would sum up my experience as: serviceable. Do I want to live her long-term? Definitely not, but for a couple semesters, it'll do. The landlord is not the worst I've had, though she could be better and the rent price is fair.",
    "date": "April 6, 2021"
  },

  {
    "id": 50,
    "aptId": 42,
    "landlordId": 6,
    "overallRating": null,
    "detailedRatings.location": "",
    "detailedRatings.safety": "",
    "detailedRatings.maintenance": "",
    "detailedRatings.condition": "",
    "reviewText": "I have not yet lived at my apartment for long now but hearing from others, he is extremely strict about getting back the money from our security deposits and purposefully overcharges us for minuscule things. In addition, he has been disregarding the Ithaca freeze or even the option to use our security deposit to pay the monthly rent, even though it was a state mandated order.",
    "date": "July 1, 2020"
  },

  {
    "id": 67,
    "aptId": 14,
    "landlordId": 4,
    "overallRating": 4,
    "detailedRatings.location": 3,
    "detailedRatings.safety": 5,
    "detailedRatings.maintenance": 5,
    "detailedRatings.condition": 5,
    "reviewText": "CTT is a very nice apartment complex. Some people might think it's too far away from campus, but it's not too bad if you use the shuttle bus that runs every 10 minutes in the morning. The price is relatively reasonable compared to the apartments in Collegetown, we have huge parking spaces, there are washer-dryer units built in, there are compost grinders in every kitchen sink.",
    "date": "October 14, 2021"
  },
  {
    "id": 68,
    "aptId": 14,
    "landlordId": 4,
    "overallRating": 4,
    "detailedRatings.location": 2,
    "detailedRatings.safety": 4,
    "detailedRatings.maintenance": 4,
    "detailedRatings.condition": 5,
    "reviewText": "Very clean and great quality, but a bit far from Campus.",
    "date": "October 14, 2021"
  },
  {
    "id": 69,
    "aptId": 84,
    "landlordId": 10,
    "overallRating": 4,
    "detailedRatings.location": 5,
    "detailedRatings.safety": 4,
    "detailedRatings.maintenance": 3,
    "detailedRatings.condition": 3,
    "date": "October 14, 2021"
  },
  {
    "id": 70,
    "aptId": 14,
    "landlordId": 4,
    "overallRating": 4,
    "detailedRatings.location": 2,
    "detailedRatings.safety": 4,
    "detailedRatings.maintenance": 4,
    "detailedRatings.condition": 4,
    "reviewText": "The cons is that it is bit far away from the campus. I can not go back to my house if I leave something there since it takes more than 40 minutes to go back and come. Also, there is no concierge, so we have to manually pick up our package. The pro is that price is reasonable and cheap relative to its fairly good facilities. I love how it is modern and the laundry system is inside house. This is very convenient.",
    "date": "October 14, 2021"
  },
  {
    "id": 71,
    "aptId": 240,
    "landlordId": 35,
    "overallRating": 4,
    "detailedRatings.location": 3,
    "detailedRatings.safety": 4,
    "detailedRatings.maintenance": 4,
    "detailedRatings.condition": 4,
    "reviewText": "Overall, location isn't the best (have to walk up a slight slope) but not too far from campus. Neighbors can be loud as well but that's only on certain days of the year. Really like the amount of space for the price though and the apartment layout is really roomy.",
    "date": "October 14, 2021"
  },
  {
    "id": 72,
    "aptId": 14,
    "landlordId": 4,
    "overallRating": 5,
    "detailedRatings.location": 3,
    "detailedRatings.safety": 5,
    "detailedRatings.maintenance": 5,
    "detailedRatings.condition": 5,
    "reviewText": "Amazing living experience",
    "date": "October 14, 2021"
  },
  {
    "id": 73,
    "aptId": 241,
    "landlordId": 36,
    "overallRating": 5,
    "detailedRatings.location": 3,
    "detailedRatings.safety": 5,
    "detailedRatings.maintenance": 5,
    "detailedRatings.condition": 4,
    "reviewText": "I have really enjoyed living in this house! It is a great place for a large group of friends, and a very cozy house! Totally recommend living here if you are up for a little bit of a commute to campus (off of North). Also a very affordable price!",
    "date": "October 14, 2021"
  },
  {
    "id": 74,
    "aptId": 242,
    "landlordId": 37,
    "overallRating": 5,
    "detailedRatings.location": 5,
    "detailedRatings.safety": 5,
    "detailedRatings.maintenance": 5,
    "detailedRatings.condition": 5,
    "reviewText": "Great location, Good Price, Friendly owners that are very accommodating. Utilities are included. Quiet neighborhood that is perfect for grad students.",
    "date": "October 15, 2021"
  },

  {
    "id": 76,
    "aptId": 173,
    "landlordId": 21,
    "overallRating": 4,
    "detailedRatings.location": 4,
    "detailedRatings.safety": 4,
    "detailedRatings.maintenance": 4,
    "detailedRatings.condition": 4,
    "reviewText": "It's nice and spacious. Ceilings are high so it makes it feel more home-y. Provided furniture is extremely comfortable and livable. Rooms are decent size with good doors and windows (they aren't broken) and each room has a closet space. Kitchen is decently large with a lot of cabinets and bathrooms are a little small but there are two full bathrooms which is really nice for a group of 4. In-unit laundry is amazing.",
    "date": "October 15, 2021"
  },
  {
    "id": 77,
    "aptId": 215,
    "landlordId": 24,
    "overallRating": 4,
    "detailedRatings.location": 4,
    "detailedRatings.safety": 5,
    "detailedRatings.maintenance": 4,
    "detailedRatings.condition": 5,
    "reviewText": "It’s slightly down the slope but at least it’s close to West Campus and right next to a bus stop. The building itself is fine, and the office is reachable during working hours. Maintenance takes a while. Overall, it’s a good spot.",
    "date": "October 16, 2021"
  },
  {
    "id": 78,
    "aptId": 129,
    "landlordId": 16,
    "overallRating": 4,
    "detailedRatings.location": 2,
    "detailedRatings.safety": 4,
    "detailedRatings.maintenance": 4,
    "detailedRatings.condition": 4,
    "reviewText": "Pretty happy with the apartment, I like everything about the apartment except the location but even then the shuttle runs during the week and early during the weekend. Kind of annoying if you need to go to CTOWN during the weekend.",
    "date": "October 18, 2021"
  },
  {
    "id": 79,
    "aptId": 244,
    "landlordId": 39,
    "overallRating": 4,
    "detailedRatings.location": 5,
    "detailedRatings.safety": 5,
    "detailedRatings.maintenance": 4,
    "detailedRatings.condition": 3,
    "reviewText": "Maintenance is really fast and the staff are really nice. The only problem is the price of rent.",
    "date": "October 30, 2021"
  },
  {
    "id": 80,
    "aptId": 124,
    "landlordId": 10,
    "overallRating": 3,
    "detailedRatings.location": 4,
    "detailedRatings.safety": 3,
    "detailedRatings.maintenance": 2,
    "detailedRatings.condition": 2,
    "reviewText": "the best part about aces apartment is the location and it’s proximity to everything in ctown and campus, but the building itself is extremely old and you should definitely keep this in mind when deciding to move in or not! the rooms are also very different in size and quality (noise-wise as well) so keep this in mind!!",
    "date": "October 30, 2021"
  },
  {
    "id": 81,
    "aptId": 84,
    "landlordId": 10,
    "overallRating": 3,
    "detailedRatings.location": 5,
    "detailedRatings.safety": 4,
    "detailedRatings.maintenance": 3,
    "detailedRatings.condition": 3,
    "reviewText": "Cleanliness of apartment depends on which unity you lease. Highly recommend viewing the unit before leasing. Certain things such as shower door were broken.",
    "date": "October 30, 2021"
  },
  {
    "id": 82,
    "aptId": 173,
    "landlordId": 21,
    "overallRating": 4,
    "detailedRatings.location": 4,
    "detailedRatings.safety": 4,
    "detailedRatings.maintenance": 4,
    "detailedRatings.condition": 4,
    "date": "October 30, 2021"
  },
  {
    "id": 83,
    "aptId": 243,
    "landlordId": 38,
    "overallRating": 4,
    "detailedRatings.location": 5,
    "detailedRatings.safety": 5,
    "detailedRatings.maintenance": 3,
    "detailedRatings.condition": 4,
    "reviewText": "This is one of the best apartments in Collegetown. However, I have faced a few bug problems, such as a few spiders and a worm or two when it rained. Overall though, the place is clean, quiet, and has a great location.",
    "date": "October 30, 2021"
  }
]
